In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("../Data-Analysis-Datasets/Datasets-Practice/hr_data.csv")
df

,employee_id,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,department,salary
0,1003,2,157,3,0,1,0,sales,low
1,1005,5,262,6,0,1,0,sales,medium
2,1486,7,272,4,0,1,0,sales,medium
3,1038,5,223,5,0,1,0,sales,low
4,1057,2,159,3,0,1,0,sales,low
...,...,...,...,...,...,...,...,...,...
14994,87670,2,151,3,0,1,0,support,low
14995,87673,2,160,3,0,1,0,support,low
14996,87679,2,143,3,0,1,0,support,low
14997,87681,6,280,4,0,1,0,support,low
14998,87684,2,158,3,0,1,0,support,low

In [3]:
df.head()       # first 5 rows

,employee_id,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,department,salary
0,1003,2,157,3,0,1,0,sales,low
1,1005,5,262,6,0,1,0,sales,medium
2,1486,7,272,4,0,1,0,sales,medium
3,1038,5,223,5,0,1,0,sales,low
4,1057,2,159,3,0,1,0,sales,low

In [4]:
df.tail()       # last 5 rows

,employee_id,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,department,salary
14994,87670,2,151,3,0,1,0,support,low
14995,87673,2,160,3,0,1,0,support,low
14996,87679,2,143,3,0,1,0,support,low
14997,87681,6,280,4,0,1,0,support,low
14998,87684,2,158,3,0,1,0,support,low

In [5]:
print(df.describe())
print("-----------------------------------------")

        employee_id  number_project  average_montly_hours  time_spend_company  \
count  14999.000000    14999.000000          14999.000000        14999.000000
mean   45424.627575        3.803054            201.050337            3.498233
std    25915.900127        1.232592             49.943099            1.460136
min     1003.000000        2.000000             96.000000            2.000000
25%    22872.500000        3.000000            156.000000            3.000000
50%    45448.000000        4.000000            200.000000            3.000000
75%    67480.500000        5.000000            245.000000            4.000000
max    99815.000000        7.000000            310.000000           10.000000

       Work_accident          left  promotion_last_5years
count   14999.000000  14999.000000           14999.000000
mean        0.144610      0.238083               0.021268
std         0.351719      0.425924               0.144281
min         0.000000      0.000000               0.000000
25%         0.000000      0.000000               0.000000
50%         0.000000      0.000000               0.000000
75%         0.000000      0.000000               0.000000
max         1.000000      1.000000               1.000000
-----------------------------------------

In [6]:
df.info()       # column info

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14999 entries, 0 to 14998
Data columns (total 9 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   employee_id            14999 non-null  int64
 1   number_project         14999 non-null  int64
 2   average_montly_hours   14999 non-null  int64
 3   time_spend_company     14999 non-null  int64
 4   Work_accident          14999 non-null  int64
 5   left                   14999 non-null  int64
 6   promotion_last_5years  14999 non-null  int64
 7   department             14999 non-null  object
 8   salary                 14999 non-null  object
dtypes: int64(7), object(2)
memory usage: 1.0+ MB

In [7]:
df.describe()   # summary statistics

,employee_id,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years
count,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000
mean,45424.627575,3.803054,201.050337,3.498233,0.144610,0.238083,0.021268
std,25915.900127,1.232592,49.943099,1.460136,0.351719,0.425924,0.144281
min,1003.000000,2.000000,96.000000,2.000000,0.000000,0.000000,0.000000
25%,22872.500000,3.000000,156.000000,3.000000,0.000000,0.000000,0.000000
50%,45448.000000,4.000000,200.000000,3.000000,0.000000,0.000000,0.000000
75%,67480.500000,5.000000,245.000000,4.000000,0.000000,0.000000,0.000000
max,99815.000000,7.000000,310.000000,10.000000,1.000000,1.000000,1.000000

In [8]:
df['employee_id']            # select column

0         1003
1         1005
2         1486
3         1038
4         1057
         ...
14994    87670
14995    87673
14996    87679
14997    87681
14998    87684
Name: employee_id, Length: 14999, dtype: int64

In [9]:
df.iloc[0]            # select row by index

employee_id               1003
number_project               2
average_montly_hours       157
time_spend_company           3
Work_accident                0
left                         1
promotion_last_5years        0
department               sales
salary                     low
Name: 0, dtype: object

In [10]:
#Sorting
df.sort_values('number_project')

,employee_id,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,department,salary
14984,87612,2,148,3,0,1,0,technical,medium
14982,87608,2,137,3,0,1,0,technical,medium
18,3794,2,160,3,1,1,1,sales,low
16,58014,2,160,3,0,1,0,sales,low
15,1113,2,143,3,0,1,0,sales,low
...,...,...,...,...,...,...,...,...,...
73,1454,7,295,4,0,1,0,product_mng,low
739,24446,7,275,4,0,1,0,support,medium
740,24553,7,291,4,0,1,0,support,medium
43,7010,7,281,4,0,1,0,technical,low
54,1341,7,307,4,0,1,0,support,low

In [11]:
print(df.shape)
print("-----------------------------------------")

(14999, 9)
-----------------------------------------

In [12]:
print(df.columns)
print("-----------------------------------------")

Index(['employee_id', 'number_project', 'average_montly_hours',
       'time_spend_company', 'Work_accident', 'left', 'promotion_last_5years',
       'department', 'salary'],
      dtype='object')
-----------------------------------------

In [13]:
print(df.dtypes)
print("-----------------------------------------")

employee_id               int64
number_project            int64
average_montly_hours      int64
time_spend_company        int64
Work_accident             int64
left                      int64
promotion_last_5years     int64
department               object
salary                   object
dtype: object
-----------------------------------------

In [14]:
df['salary'].value_counts()

salary
low       7316
medium    6446
high      1237
Name: count, dtype: int64

In [15]:
df['department'].value_counts()

department
sales          4140
technical      2720
support        2229
IT             1227
product_mng     902
marketing       858
RandD           787
accounting      767
hr              739
management      630
Name: count, dtype: int64

In [16]:
df.sample()

,employee_id,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,department,salary
11054,64843,4,178,2,0,0,0,support,medium

In [17]:
df.sample(45)

,employee_id,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,department,salary
6466,38166,2,132,3,0,0,0,support,low
1773,11031,6,273,4,0,1,0,sales,low
4194,24853,3,146,3,0,0,0,RandD,medium
7273,23804,5,259,4,0,0,0,sales,low
4786,28258,4,162,2,1,0,0,support,medium
8159,48248,4,190,2,0,0,0,product_mng,medium
14270,83372,4,225,5,0,1,0,technical,low
3052,18282,4,232,3,0,0,0,RandD,low
4931,29121,5,232,3,0,0,0,support,medium
3485,20934,4,192,2,0,0,0,support,low
8951,52921,4,246,3,0,0,0,sales,low
6984,41424,3,217,3,0,0,0,technical,medium
11468,94599,3,166,2,0,0,0,sales,low
4480,26573,5,212,2,0,0,0,support,low
5262,30932,5,207,4,1,0,0,RandD,low
12205,71306,2,153,3,0,1,0,support,low
1748,10864,4,219,6,0,1,0,product_mng,medium
2588,15521,2,226,3,0,0,0,RandD,low
5742,44329,5,222,3,0,0,0,sales,medium
3580,21415,3,250,4,0,0,0,IT,low
7869,19719,6,178,3,1,0,0,sales,medium
3826,22794,3,181,3,0,0,0,sales,low
8466,50050,4,264,3,0,0,0,product_mng,medium
9321,78929,4,217,3,0,0,0,sales,low
1406,8962,4,257,3,0,1,0,hr,low
9780,57704,3,163,2,0,0,0,sales,high
7175,42476,4,161,2,0,0,0,RandD,medium
3796,22643,3,199,2,0,0,0,technical,low
3124,18714,3,181,2,0,0,0,IT,low
5486,32349,4,155,3,1,0,0,product_mng,low
11219,65810,2,275,6,1,0,1,hr,medium
11772,89255,4,178,2,0,0,0,sales,low
12841,74828,4,151,4,0,0,0,sales,medium
10296,5779,2,254,3,0,0,0,product_mng,low
9151,54017,5,180,4,0,0,0,product_mng,medium
6299,37171,3,259,2,0,0,0,technical,medium
5305,31260,2,284,2,0,0,0,technical,low
12712,74079,5,270,5,0,1,0,sales,low
287,2773,6,292,4,0,1,1,technical,low
2973,17910,4,161,3,0,0,0,RandD,low
13963,81582,3,209,3,0,0,0,product_mng,medium
6482,38275,4,248,2,0,0,0,RandD,medium
9284,72672,3,257,2,0,0,0,support,low
12806,74649,5,196,3,0,0,0,IT,medium
1044,7006,3,179,2,0,1,0,support,medium

In [18]:
df.loc[22]

employee_id               1158
number_project               6
average_montly_hours       304
time_spend_company           4
Work_accident                0
left                         1
promotion_last_5years        0
department               sales
salary                     low
Name: 22, dtype: object

In [19]:
df.loc[22:100]

,employee_id,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,department,salary
22,1158,6,304,4,0,1,0,sales,low
23,1166,2,139,3,0,1,0,sales,low
24,1175,2,158,3,0,1,0,sales,low
25,1184,5,242,5,0,1,0,sales,low
26,1186,4,239,5,0,1,0,sales,low
...,...,...,...,...,...,...,...,...,...
96,1610,6,265,4,0,1,0,sales,low
97,1622,6,279,4,0,1,0,sales,low
98,1639,6,284,4,0,1,0,sales,low
99,1641,5,221,6,0,1,0,sales,medium
100,1642,2,154,3,0,1,0,sales,medium

In [20]:
df.loc[[2,5,7],["department","salary"]]

  department  salary
2      sales  medium
5      sales     low
7      sales     low

In [21]:
df.loc[1:4, ["department","salary"]]

  department  salary
1      sales  medium
2      sales  medium
3      sales     low
4      sales     low

In [22]:
df.iloc[0]

employee_id               1003
number_project               2
average_montly_hours       157
time_spend_company           3
Work_accident                0
left                         1
promotion_last_5years        0
department               sales
salary                     low
Name: 0, dtype: object

In [23]:
df.iloc[0:5]

,employee_id,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,department,salary
0,1003,2,157,3,0,1,0,sales,low
1,1005,5,262,6,0,1,0,sales,medium
2,1486,7,272,4,0,1,0,sales,medium
3,1038,5,223,5,0,1,0,sales,low
4,1057,2,159,3,0,1,0,sales,low

In [24]:
df.iloc[:, 2]

0        157
1        262
2        272
3        223
4        159
        ...
14994    151
14995    160
14996    143
14997    280
14998    158
Name: average_montly_hours, Length: 14999, dtype: int64

In [25]:
df.iloc[0:4, 1:3]

   number_project  average_montly_hours
0               2                   157
1               5                   262
2               7                   272
3               5                   223

In [26]:
df.head()

,employee_id,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,department,salary
0,1003,2,157,3,0,1,0,sales,low
1,1005,5,262,6,0,1,0,sales,medium
2,1486,7,272,4,0,1,0,sales,medium
3,1038,5,223,5,0,1,0,sales,low
4,1057,2,159,3,0,1,0,sales,low

In [27]:
df.columns

Index(['employee_id', 'number_project', 'average_montly_hours',
       'time_spend_company', 'Work_accident', 'left', 'promotion_last_5years',
       'department', 'salary'],
      dtype='object')

In [29]:
df["department"].unique()

array(['sales', 'accounting', 'hr', 'technical', 'support', 'management',
       'IT', 'product_mng', 'marketing', 'RandD'], dtype=object)

In [30]:
df[(df["department"] == "sales") & (df["salary"] == "low")]

,employee_id,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,department,salary
0,1003,2,157,3,0,1,0,sales,low
3,1038,5,223,5,0,1,0,sales,low
4,1057,2,159,3,0,1,0,sales,low
5,1060,2,153,3,0,1,0,sales,low
6,1061,6,247,4,0,1,0,sales,low
...,...,...,...,...,...,...,...,...,...
14963,90813,6,271,4,0,1,0,sales,low
14964,87480,6,280,4,0,1,0,sales,low
14965,87497,2,149,3,0,1,0,sales,low
14966,87500,5,219,5,0,1,0,sales,low
14967,87507,2,128,3,0,1,0,sales,low

In [31]:
df[(df["promotion_last_5years"] == 1) & (df["average_montly_hours"] > 4)]

,employee_id,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,department,salary
18,3794,2,160,3,1,1,1,sales,low
82,1506,4,139,3,0,1,1,management,low
171,2016,2,160,3,0,1,1,sales,low
287,2773,6,292,4,0,1,1,technical,low
584,4300,2,154,3,0,1,1,support,medium
...,...,...,...,...,...,...,...,...,...
14229,83135,2,160,3,1,1,1,sales,low
14293,83468,4,139,3,0,1,1,management,low
14382,84032,2,160,3,0,1,1,sales,low
14498,84776,6,292,4,0,1,1,technical,low
14795,86564,2,154,3,0,1,1,support,medium

In [33]:
# fetch the data of employees who got promotion  and working more than 4 hours
df[(df["promotion_last_5years"] == 1) & (df["time_spend_company"] > 4)]

,employee_id,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,department,salary
1000,6792,4,258,5,1,1,1,sales,medium
4541,88646,3,286,6,0,0,1,technical,medium
4552,26968,4,269,5,0,0,1,support,medium
4556,26993,4,163,5,0,0,1,support,low
4735,27931,6,275,5,1,0,1,support,medium
...,...,...,...,...,...,...,...,...,...
14205,83010,3,193,10,0,0,1,management,high
14206,83017,3,259,10,1,0,1,management,high
14207,83019,5,266,10,0,0,1,management,high
14208,83020,3,185,10,0,0,1,management,high
14209,83025,3,172,10,0,0,1,marketing,high

In [30]:
df[df["left"].isnull()]

Empty DataFrame
Columns: [employee_id, number_project, average_montly_hours, time_spend_company, Work_accident, left, promotion_last_5years, department, salary]
Index: []

In [31]:
df[df["left"].notnull()]

,employee_id,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,department,salary
0,1003,2,157,3,0,1,0,sales,low
1,1005,5,262,6,0,1,0,sales,medium
2,1486,7,272,4,0,1,0,sales,medium
3,1038,5,223,5,0,1,0,sales,low
4,1057,2,159,3,0,1,0,sales,low
...,...,...,...,...,...,...,...,...,...
14994,87670,2,151,3,0,1,0,support,low
14995,87673,2,160,3,0,1,0,support,low
14996,87679,2,143,3,0,1,0,support,low
14997,87681,6,280,4,0,1,0,support,low
14998,87684,2,158,3,0,1,0,support,low